//
//  Eight.swift
//  SkillBox_2_1
//
//  Created by Александр Уткин on 09.01.2021.
//  Copyright © 2021 Александр Уткин. All rights reserved.
//

import Foundation

// Напишите, в чём основная идея Protocol Oriented Programming.

/*
 POP, в отличии от классического ООП, на первое место ставит протокол - сначала мы создаем описание всех классов и методов в них, и только потом занимаемся реализацией.
 Это дает большую управляемость кодом, позволяет иначе реализовать наследование - посредством расширений.
 Причем, множественного наследования в swift нет, но с помощью протоколов это можно будет реализовать, поскольку объект (класс, структура, перечисление) может соответствовать сразу нескольким протоколам. 
 
 */
 
